tests/load-tests/tsung-config-homepage.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/user/share/tsung/tsung-1.0.dtd">
<tsung loglevel="warning" version="1.7">
    <clients>
        <client host="localhost" cpu="1" use_controller_vm="true" maxusers="25000"/>
    </clients>

    <servers>
        <server host="dwa-outdoor.prod" port="80" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="60" unit="second">
            <users arrivalrate="400" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option name="ports_range" min="1025" max="65535"/>
    </options>

    <sessions>
        <session name="http-example" probability="100" type="ts_http">
            <request>
                <http url="/" method="GET"></http>
            </request>
        </session>
    </sessions>
</tsung>