tests/load-tests/tsung-config-websocket-heartbeat.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/user/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
    <clients>
        <client host="localhost" cpu="1" use_controller_vm="true" maxusers="64000" />
    </clients>

    <servers>
        <server host="dwa-outdoor.prod" port="80" type="tcp" />
    </servers>

    <load>
        <arrivalphase phase="1" duration="600" unit="second">
            <users arrivalrate="150" unit="second" />
        </arrivalphase>
    </load>

    <options>
        <option name="ports_range" min="1025" max="65535"/>
    </options>

    <sessions>
        <session name="websocket" probability="100" type="ts_websocket">
            <request>
                <websocket type="connect" path="/live/websocket?_csrf_token=IQNWCh4rHyoELS49DhMUOhoFfWIyRQc_hFeUWnraHbYympehWv2Sd-pF&amp;_track_static%5B0%5D=http%3A%2F%2Fdwa-outdoor.prod%2Fcss%2Fapp.css&amp;_track_static%5B1%5D=http%3A%2F%2Fdwa-outdoor.prod%2Fjs%2Fapp.js&amp;_mounts=0&amp;vsn=2.0.0" origin="ws://dwa-outdoor.prod"></websocket>
            </request>
            <for var="i" from="1" to="100" incr="1">
                <request>
                    <websocket type="message" frame="text">[null,"1","phoenix","heartbeat",{}]</websocket>
                </request>
                <thinktime value="15"/>
            </for>

        </session>
    </sessions>
</tsung>